# Taps / external commands
tap "domt4/autoupdate", trusted: { command: "autoupdate" }

# Core tools
brew "bat"
brew "eza"
brew "chezmoi"
brew "coreutils"
brew "findutils"
brew "git"
brew "gnu-sed"
brew "gawk"
brew "moreutils"
brew "fd"
brew "fzf"
brew "zoxide"
brew "gh"
brew "gitleaks"
brew "htop"
brew "jq"
brew "ripgrep"
brew "tree"
brew "wget"
brew "aria2"

# Dev
brew "bison"
brew "cmake"
brew "gopls"
brew "llvm"
brew "neovim"
brew "nvm"
brew "pnpm"
brew "luarocks"
brew "taplo"

# Containers
brew "colima"
brew "ctop"
brew "docker"
brew "docker-compose"
brew "lazydocker"

# Git
brew "git-delta"
brew "git-filter-repo"
brew "lazygit"

# AI/ML
brew "llama.cpp"
brew "opencode"

# Data/DB
brew "postgresql@18"
brew "redis"

# Terminal
brew "tmux"
brew "sesh"
brew "viu"

# Yazi file manager + preview dependencies
# (also uses fd, ripgrep, fzf, zoxide, jq, sevenzip from above)
brew "yazi"
brew "ffmpeg"       # video thumbnails
brew "imagemagick"  # HEIC/JXL/font previews
brew "poppler"      # PDF previews
brew "resvg"        # SVG previews

# Prompt engines (switch between them with `prompt-use`)
brew "starship"
brew "oh-my-posh"

# Misc
brew "graphviz"
brew "nmap"
brew "sevenzip"
brew "tlrc"
brew "wireshark"

# Casks
cask "1password"
cask "1password-cli"
cask "betterdisplay"
cask "chatgpt"
cask "claude"
cask "dropbox"
cask "firefox"
cask "ghostty"
cask "gitkraken"
cask "google-chrome"
cask "obsidian"
cask "rectangle"
cask "slack"
cask "spotify"
cask "stats"
cask "tailscale-app"
cask "visual-studio-code"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf"
cask "font-meslo-for-powerlevel10k"
cask "font-monaspace"     # unpatched, kept: VS Code editor.fontFamily uses "Monaspace Neon"
cask "font-monaspace-nf"
cask "font-sauce-code-pro-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-victor-mono-nerd-font"
