# Core tools
brew "bat"
brew "chezmoi"
brew "coreutils"
brew "findutils"
brew "git"
brew "gnu-sed"
brew "gawk"
brew "moreutils"
brew "fd"
brew "fzf"
brew "gh"
brew "htop"
brew "jq"
brew "ripgrep"
brew "tree"
brew "wget"
brew "zoxide"

# Dev
brew "cmake"
brew "gopls"
brew "neovim"
brew "nvm"
brew "pnpm"
brew "luarocks"
brew "taplo"

# Containers
brew "colima"
brew "ctop"
brew "docker"
brew "docker-compose"
brew "lazydocker"

# Git
brew "git-filter-repo"
brew "lazygit"

# AI/ML
brew "llama.cpp"
brew "ollama"
brew "opencode"

# Data/DB
brew "postgresql@18"
brew "redis"

# Terminal
brew "tmux"
brew "sesh"
brew "ueberzugpp"
brew "viu"

# Misc
brew "graphviz"
brew "nmap"
brew "sevenzip"
brew "tlrc"
brew "wireshark"

# Casks
cask "1password"
cask "1password-cli"
cask "betterdisplay"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cursor"
cask "discord"
cask "dropbox"
cask "firefox"
cask "ghostty"
cask "gitkraken"
cask "google-chrome"
cask "karabiner-elements"
cask "obsidian"
cask "ollama-app"
cask "rectangle"
cask "setapp"
cask "slack"
cask "spotify"
cask "stats"
cask "zoom"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf"
cask "font-meslo-for-powerlevel10k"
cask "font-monaspace"
cask "font-victor-mono-nerd-font"
