alvinunreal.claude-vscode-theme
anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-containers
arjunumathanu.monokai-dark-pro
asvetliakov.vscode-neovim
atomiks.moonlight
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
christian-kohler.npm-intellisense
docker.docker
donjayamanne.githistory
dracula-theme.theme-dracula
eamodio.gitlens
editorconfig.editorconfig
enkia.tokyo-night
esbenp.prettier-vscode
eserozvataf.one-dark-pro-monokai-darker
fosshaas.fontsize-shortcuts
github.github-vscode-theme
jdinhlife.gruvbox
jock.svg
mermaidchart.vscode-mermaid-chart
mikestead.dotenv
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-vscode.makefile-tools
njpwerner.autodocstring
njqdev.vscode-python-typehint
pkief.markdown-checkbox
redhat.vscode-xml
redhat.vscode-yaml
rodolphebarbanneau.python-docstring-highlighter
rvest.vs-code-prettier-eslint
sainnhe.gruvbox-material
shd101wyy.markdown-preview-enhanced
sndst00m.markdown-github-dark-pack
tamasfe.even-better-toml
tomoki1207.pdf
usernamehw.errorlens
vira.vsc-vira-theme
yzhang.markdown-all-in-one
